# Citrus-YOLO11: A Lightweight and Robust Detector for Real-Time Citrus Detection

# Parameters
nc: 2  # 0: orange, 1: interferer
scales:
  n: [0.50, 0.25, 1024]

# Backbone
backbone:
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  
  # Block 1
  - [-1, 2, LLKFE, [256, False, 0.25]] # 2
  - [-1, 1, AFR, [256]]                # 3

  # Block 2
  - [-1, 1, Conv, [256, 3, 2]]         # 4-P3/8
  - [-1, 2, LLKFE, [512, False, 0.25]] # 5
  - [-1, 1, AFR, [512]]                # 6 (P3 Output)

  # Block 3
  - [-1, 1, Conv, [512, 3, 2]]         # 7-P4/16
  - [-1, 2, LLKFE, [512, True]]        # 8
  - [-1, 1, AFR, [512]]                # 9 (P4 Output)

  # Block 4
  - [-1, 1, Conv, [1024, 3, 2]]        # 10-P5/32
  - [-1, 2, LLKFE, [1024, True]]       # 11
  - [-1, 1, AFR, [1024]]               # 12 (P5 Output)
  
  # Deep Features
  - [-1, 1, DPSPP, [1024]]             # 13
  - [-1, 2, C2PSA, [1024]]             # 14 (P5 Final Output)

# Head (CAMA Framework)
head:
  # === Top-Down Path ===
  # P5 -> P4
  - [-1, 1, CAMA, [2]]                     # 15
  - [[-1, 9], 1, BiFPN_Add, [512]]         # 16
  - [-1, 2, LLKFE, [512, False]]           # 17

  # P4 -> P3
  - [-1, 1, CAMA, [2]]                     # 18
  - [[-1, 6], 1, BiFPN_Add, [256]]         # 19
  - [-1, 2, LLKFE, [256, False]]           # 20 (P3 Output)

  # === Bottom-Up Path ===
  # P3 -> P4
  - [-1, 1, Conv, [256, 3, 2]]             # 21
  - [[-1, 17], 1, BiFPN_Add, [512]]        # 22
  - [-1, 2, LLKFE, [512, False]]           # 23 (P4 Output)

  # P4 -> P5
  - [-1, 1, Conv, [512, 3, 2]]             # 24
  - [[-1, 14], 1, BiFPN_Add, [1024]]       # 25
  - [-1, 2, LLKFE, [1024, True]]           # 26 (P5 Output)

  # Detect
  - [[20, 23, 26], 1, Detect, [nc]]        # 27